#ifndef PDF_H
#define PDF_H

#include <QPrinter>
#include <QTextDocument>
#include <QDebug>
#include <QFile>
#include <QTextDecoder>
#include "products.h"
#include "declaration.h"
class PDF
{
public:
    PDF();
    void createPDFfile(const QString& json, products* prd, Declaration* dcl);
    QString readPDFfile(const QString& path);
private:
    QStringList list = {"Декларация", "Отправитель / Экспортер", "Всего мест", "Получатель", "Лицо, ответственное за финансовое урегулирование", "Страна перв. назн./послед. отправил", "Торговая страна / страна производства",
                       "ЕСП", "Декларант/Представитель", "Страна отправления/экспорта", "Код страны отправления/экспорта", "Страна происхождения",
                       "страна назначения", "Код страны назначения", "Идентификация и страна регистрации транспортного средства при отправлении/прибытии", "Контейнер",
                        "Условия поставки", "Идентификация и страна регистрации активного транспортного средства на границе", "Валюта и общая сумма по счету", "Курс валюты", "Характер сделки", "Вид транспорта на границе",
                       "Вид транспорта внутри страны", "Место погрузки/разгрузки", "Финансовые и банковские сведения", "Таможенный орган выезда/въезда", "Местонахождение товара", "Реквизиты склада", "Принципал", "Гарантия не действительна для", "Таможенный орган (и страна) назначения", "Дата"};
    QStringList list2 = {"1", "2", "6", "8", "9", "10", "11", "13", "14", "15", "15_1", "16", "17", "17_1", "18", "19", "20", "21", "22", "23", "24", "25", "26", "27",
                        "28", "29", "30", "49", "50", "52", "53", "54"};
};

#endif // PDF_H
